Bhavya-Saravanan/BLE-Firmware-EFR32BG/app.c
/***************************************************************************//**
 * @file
 * @brief Core application logic.
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * Date:        02-25-2022
 * Author:      Dave Sluiter
 * Description: This code was created by the Silicon Labs application wizard
 *              and started as "Bluetooth - SoC Empty".
 *              It is to be used only for ECEN 5823 "IoT Embedded Firmware".
 *              The MSLA referenced above is in effect.
 *
 *
 *
 * Student edit: Add your name and email address here:
 * @student    Bhavya Saravanan, bhsa3618@Colorado.edu
 *
 *
 *
 ******************************************************************************/
#include <stdbool.h>
#include "em_common.h"
#include "app_assert.h"
#include "sl_bluetooth.h"
#include "gatt_db.h"
#include "app.h"
#include "src/timer.h"
#include "src/oscillator.h"
#include "src/scheduler.h"


#include "src/irq.h"
#include "src/i2c.h"
#include <stdint.h>




// *************************************************
// Students: It is OK to modify this file.
//           Make edits appropriate for each
//           assignment.
// *************************************************

#include "sl_status.h"             // for sl_status_print()

#include "src/ble_device_type.h"
#include "src/gpio.h"
#include "src/lcd.h"
#include "src/i2c.h"
#include "src/ble.h"

// Students: Here is an example of how to correctly include logging functions in
//           each .c file.
//           Apply this technique to your other .c files.
//           Do not #include "src/log.h" in any .h file! This logging scheme is
//           designed to be included at the top of each .c file that you want
//           to call one of the LOG_***() functions from.

// Include logging specifically for this .c file
#define INCLUDE_LOG_DEBUG 1
#include "src/log.h"




// *************************************************
// Power Manager
// *************************************************

// See: https://docs.silabs.com/gecko-platform/latest/service/power_manager/overview
#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)

// -----------------------------------------------------------------------------
// defines for power manager callbacks
// -----------------------------------------------------------------------------
// Return values for app_is_ok_to_sleep():
//   Return false to keep sl_power_manager_sleep() from sleeping the MCU.
//   Return true to allow system to sleep when you expect/want an IRQ to wake
//   up the MCU from the call to sl_power_manager_sleep() in the main while (1)
//   loop.
//
// Students: We'll need to modify this for A2 onward so that compile time we
//           control what the lowest EM (energy mode) the MCU sleeps to. So
//           think "#if (expression)".


#define APP_IS_OK_TO_SLEEP      ((LOWEST_ENERGY_MODE == 0)? false :true)


// Return values for app_sleep_on_isr_exit():
//   SL_POWER_MANAGER_IGNORE; // The module did not trigger an ISR and it doesn't want to contribute to the decision
//   SL_POWER_MANAGER_SLEEP;  // The module was the one that caused the system wakeup and the system SHOULD go back to sleep
//   SL_POWER_MANAGER_WAKEUP; // The module was the one that caused the system wakeup and the system MUST NOT go back to sleep
//
// Notes:
//       SL_POWER_MANAGER_IGNORE, we see calls to app_process_action() on each IRQ. This is the
//       expected "normal" behavior.
//
//       SL_POWER_MANAGER_SLEEP, the function app_process_action()
//       in the main while(1) loop will not be called! It would seem that sl_power_manager_sleep()
//       does not return in this case.
//
//       SL_POWER_MANAGER_WAKEUP, doesn't seem to allow ISRs to run. Main while loop is
//       running continuously, flooding the VCOM port with printf text with LETIMER0 IRQs
//       disabled somehow, LED0 is not flashing.

#define APP_SLEEP_ON_ISR_EXIT   (SL_POWER_MANAGER_IGNORE)
//#define APP_SLEEP_ON_ISR_EXIT   (SL_POWER_MANAGER_SLEEP)
//#define APP_SLEEP_ON_ISR_EXIT   (SL_POWER_MANAGER_WAKEUP)

#endif // defined(SL_CATALOG_POWER_MANAGER_PRESENT)




// *************************************************
// Power Manager Callbacks
// The values returned by these 2 functions AND
// adding and removing power manage requirements is
// how we control when EM mode the MCU goes to when
// sl_power_manager_sleep() is called in the main
// while (1) loop.
// *************************************************

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)

bool app_is_ok_to_sleep(void)
{
  return APP_IS_OK_TO_SLEEP ;
} // app_is_ok_to_sleep()



sl_power_manager_on_isr_exit_t app_sleep_on_isr_exit(void)
{
  return APP_SLEEP_ON_ISR_EXIT;
} // app_sleep_on_isr_exit()

#endif // defined(SL_CATALOG_POWER_MANAGER_PRESENT)




/**************************************************************************//**
 * Application Init.
 *****************************************************************************/
/**
 * @brief  Initializes the application.
 *
 * This function initializes essential system components such as
 * GPIO, oscillators, timers, and I2C communication. It also configures
 * power management requirements based on the lowest selected energy mode.
 *
 * @param  None
 * @return None
 */
SL_WEAK void app_init(void)
{

  // call to gpioInit()
  gpioInit();

  oscillator_init();// Initialized the oscillator to configure the clock source.



  if (LOWEST_ENERGY_MODE == 1)// Setting the power manager requirements based on the lowest energy mode
     sl_power_manager_add_em_requirement(SL_POWER_MANAGER_EM1);
  else if (LOWEST_ENERGY_MODE == 2)
     sl_power_manager_add_em_requirement(SL_POWER_MANAGER_EM2);


} // app_init()


/**
 * @brief Processes scheduled events.
 *
 * This function fetches the next scheduled event from the event queue and
 * passes it to the state machine for further processing.
 *
 * @param None
 * @return None
 */
SL_WEAK void app_process_action(void)
{
    /*static state_t currentState = STATE_IDLE; // Current state of the state machine
    uint32_t evt = getNextEvent(); // Fetch the next pending event

    // Process the event using the state machine
    handle_state_machine(&currentState, evt);*/
}

/**
 * @brief Handles the state transitions based on events.
 *
 * This function manages the state transitions of the system based on
 * the received event. It implements a finite state machine to process
 * sensor readings, manage power states, and control I2C transactions.
 *
 * @param currentState Pointer to the current state of the system.
 * @param The event that triggers state transitions.
 * @return None
 */



/**************************************************************************//**
 * Bluetooth stack event handler.
 * This overrides the dummy weak implementation.
 *
 * @param[in] evt Event coming from the Bluetooth stack.
 *
 * The code here will process events from the Bluetooth stack. This is the only
 * opportunity we will get to act on an event.
 *
 *****************************************************************************/
void sl_bt_on_event(sl_bt_msg_t *evt)
{
  // You may want to save some values from certain BLE events that your
  // new state machine can examine.
  handle_ble_event(evt); //responders for the event
  #if DEVICE_IS_BLE_SERVER
  // SERVER
  // sequence through states driven by events
  state_machine_project(evt);    //state transition to get the temperature value
  #else
   //CLIENT
  // sequence through service and characteristic discovery
  discovery_state_machine(evt);
  #endif

} // sl_bt_on_event()


